#include <iostream>
#include <format>

using namespace std;

int main() {
  ios_base::sync_with_stdio(false);

  cout << format(
    "+- Ответ -----------------------------------+\n"
    "│  Группа: {:<13}                    │\n"
    "│   Автор: {:<13}                    │\n"
    "│ Вариант: {:<13}                    │\n"
    "+-------------------------------------------+\n",
    "6111", "Борисик Мирон", "2");

  cout << "\nВведите числа (для завершения введите 0): \n";

  int count = 0;
  int mp = 1;
  int num = 0;
  while (true) {
    cin >> num;
      if (num == 0) break;
        mp *= num;
        count++;

      
  }

  cout << format(
    "+- Ответ -----------------------------------+\n"
    "│ Количество элементов: {:<13}       │\n"
    "│   Произведение чисел: {:<13}       │\n"
    "+-------------------------------------------+\n",
    count, mp);
    
  return 0;
}

